---
kind: method
id: M:Autodesk.Revit.DB.Structure.BoundaryConditions.SetOrientTo(Autodesk.Revit.DB.Structure.BoundaryConditionsOrientTo)
source: html/8d8d9e31-30ca-a099-d546-cdc1aeb61c7b.htm
---
# Autodesk.Revit.DB.Structure.BoundaryConditions.SetOrientTo Method

Sets the boundary condition orientation option.

## Syntax (C#)
```csharp
public void SetOrientTo(
	BoundaryConditionsOrientTo orientTo
)
```

## Parameters
- **orientTo** (`Autodesk.Revit.DB.Structure.BoundaryConditionsOrientTo`) - The new orientation option.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - A value passed for an enumeration argument is not a member of that enumeration